InformationRegisters/НастройкиПравДоступаОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПравДоступаОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Добавление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Изменение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Печать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Проведение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Удаление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>РазделениеПоРесторанам</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПраваДоступаПользователей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделениеПоСотрудникам</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПраваДоступаПользователей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИгнорироватьРазделениеПоРесторанам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИгнорироватьРазделениеПоСотрудникам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОбъектДоступа</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВладелецПравДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ПраваДоступаПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>ПраваДоступаПользователей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запретить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разрешить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Привилегированные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/НастройкиПравДоступаОбъектов/Ext/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	
	// При обмене данными ничего не проверяем.
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеТиповСправочников = Справочники.ТипВсеСсылки();
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		// Нормализация.
		Если ОписаниеТиповСправочников.СодержитТип(ТипЗнч(Запись.ОбъектДоступа)) Тогда
		
			Запись.Печать = Ложь;
			Запись.Проведение = Ложь;
			Запись.РазделениеПоРесторанам = Неопределено;
			Запись.РазделениеПоСотрудникам = Неопределено;
			
		Иначе
			
			Запись.РазделениеПоРесторанам = __ОбщегоНазначенияКлиентСервер.ПолучитьНеПустоеЗначение(Запись.РазделениеПоРесторанам, Перечисления.ПраваДоступаПользователей.Запретить);
			Запись.РазделениеПоСотрудникам = __ОбщегоНазначенияКлиентСервер.ПолучитьНеПустоеЗначение(Запись.РазделениеПоСотрудникам, Перечисления.ПраваДоступаПользователей.Запретить);
			
		КонецЕсли; 
		
		// Дополнение.
		Запись.ИгнорироватьРазделениеПоРесторанам = (Запись.РазделениеПоРесторанам = Перечисления.ПраваДоступаПользователей.Разрешить) Или (Запись.РазделениеПоРесторанам = Перечисления.ПраваДоступаПользователей.Привилегированные);
		Запись.ИгнорироватьРазделениеПоСотрудникам = (Запись.РазделениеПоСотрудникам = Перечисления.ПраваДоступаПользователей.Разрешить) Или (Запись.РазделениеПоСотрудникам = Перечисления.ПраваДоступаПользователей.Привилегированные);
		
	КонецЦикла;
	
КонецПроцедуры // ПередЗаписью()
